# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArray..::..Insert Method
ModelCurveArray Class See Also
---
Insert the specified model curve into the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	ModelCurve item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As ModelCurve, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	ModelCurve^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ModelCurveThe model curve to be inserted into the array.
index
    Type: System..::..Int32The model curve will be inserted before this index.
# ### Return Value
Returns whether the model curve was inserted into the array.
# See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace